Revit 2027 API
DoubleClickOptions Methods
The DoubleClickOptions type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetAction |  Returns the active user's desired action for a particular double-click target.
GetDoubleClickOptions |  Returns the current user's DoubleClickOptions.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsSupportedAction |  Checks whether the specified double-click target supports the specified action.
SetAction |  Changes the double-click action associated with a specified target.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
DoubleClickOptions Class
Autodesk.Revit.UI Namespace